# Python Pandas

## Series
The difference between numpy array and series is that the series can be labelled and can be accessed by this label

In [1]:
import pandas as pd
import numpy as np

In [2]:
label = ['a', 'b', 'c']

In [3]:
my_data = [10, 20, 30]

In [4]:
arr = np.array(my_data)

In [5]:
data_dict = {'a': 10, 'b': 20, 'c': 30}

In [6]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(data=my_data, index=label)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(arr, label)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(data_dict)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(data=label)

0    a
1    b
2    c
dtype: object

In [11]:
series_1 = pd.Series([1, 2, 3, 4], ['USA', 'Germany', 'USSR', 'Japan'])

In [12]:
series_1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [13]:
series_2 = pd.Series([1, 2, 5, 4], ['USA', 'Germany', 'Italy', 'Japan'])

In [14]:
series_2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [15]:
series_1 + series_2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

## Dataframes
It is a combination of Series

In [16]:
from numpy.random import rand
np.random.seed(101)

In [17]:
df = pd.DataFrame(rand(5,4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [18]:
df

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

In [19]:
df['W']

A    0.516399
B    0.685277
C    0.721544
D    0.181892
E    0.083561
Name: W, dtype: float64

In [20]:
type(df['W'])

pandas.core.series.Series

In [21]:
df.W

A    0.516399
B    0.685277
C    0.721544
D    0.181892
E    0.083561
Name: W, dtype: float64

In [22]:
df[['W', 'Z']]

          W         Z
A  0.516399  0.171522
B  0.685277  0.893613
C  0.721544  0.352132
D  0.181892  0.232354
E  0.083561  0.276239

In [23]:
df['new'] = df['W'] + df['Y']

In [24]:
df

          W         X         Y         Z       new
A  0.516399  0.570668  0.028474  0.171522  0.544873
B  0.685277  0.833897  0.306966  0.893613  0.992243
C  0.721544  0.189939  0.554228  0.352132  1.275771
D  0.181892  0.785602  0.965483  0.232354  1.147376
E  0.083561  0.603548  0.728993  0.276239  0.812554

In [25]:
df.drop('new', axis=1)

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

In [26]:
df

          W         X         Y         Z       new
A  0.516399  0.570668  0.028474  0.171522  0.544873
B  0.685277  0.833897  0.306966  0.893613  0.992243
C  0.721544  0.189939  0.554228  0.352132  1.275771
D  0.181892  0.785602  0.965483  0.232354  1.147376
E  0.083561  0.603548  0.728993  0.276239  0.812554

In [27]:
df.drop('new', axis=1, inplace=True)

In [28]:
df

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

#### Selecting Dataframe Rows

In [29]:
df.loc['A']

W    0.516399
X    0.570668
Y    0.028474
Z    0.171522
Name: A, dtype: float64

In [30]:
df.iloc[2]

W    0.721544
X    0.189939
Y    0.554228
Z    0.352132
Name: C, dtype: float64

#### Selecting Subset of Rows and Columns

In [31]:
df.iloc[2:,2:]

          Y         Z
C  0.554228  0.352132
D  0.965483  0.232354
E  0.728993  0.276239

In [32]:
df.loc[['A','B'],['W', 'Y']]

          W         Y
A  0.516399  0.028474
B  0.685277  0.306966

#### Condition data selection within Dataframe

In [33]:
df > 0.5

       W      X      Y      Z
A   True   True  False  False
B   True   True  False   True
C   True  False   True  False
D  False   True   True  False
E  False   True   True  False

In [34]:
df[df>0.5]

          W         X         Y         Z
A  0.516399  0.570668       NaN       NaN
B  0.685277  0.833897       NaN  0.893613
C  0.721544       NaN  0.554228       NaN
D       NaN  0.785602  0.965483       NaN
E       NaN  0.603548  0.728993       NaN

In [35]:
df['W'] > 0.5

A     True
B     True
C     True
D    False
E    False
Name: W, dtype: bool

In [36]:
df[df['W'] > 0.5]

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132

In [37]:
df[df['W'] > 0.5][['W', 'X']]

          W         X
A  0.516399  0.570668
B  0.685277  0.833897
C  0.721544  0.189939

In [38]:
df[(df['W'] > 0.5) & (df['Z']>0.5)] # Super important syntax (and, or won't work)

          W         X         Y         Z
B  0.685277  0.833897  0.306966  0.893613

In [39]:
df[(df['W'] > 0.5) | (df['Z']>0.5)] # Super important syntax (and, or won't work)

          W         X         Y         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132

#### Handling missing data

In [40]:
d = {'A': [1, 2, np.nan], 'B': [5, np.nan, np.nan], 'C': [1, 2, 3]}

In [41]:
df = pd.DataFrame(d)

In [42]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [43]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [44]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [45]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [46]:
df.fillna('empty')

       A      B  C
0      1      5  1
1      2  empty  2
2  empty  empty  3

In [47]:
df.fillna(df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

#### Grouping Dataframe

In [48]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [49]:
df = pd.DataFrame(data)

In [50]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [59]:
company_grp = df.groupby('Company')

In [60]:
company_grp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [61]:
company_grp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [68]:
company_grp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [69]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [70]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [72]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [75]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

#### Pandas merging, joining and concat

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use **pd.concat** and pass in a list of DataFrames to concatenate together:

In [76]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [77]:
df = pd.concat([df1, df2, df3])

In [78]:
df

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

#### Merging

The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [79]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [81]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [82]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [80]:
pd.merge(left, right, how="inner", on="key")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

#### Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [85]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [86]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [87]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

#### Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [88]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [90]:
df['col2'].unique() # unique elements in a row

array([444, 555, 666])

In [92]:
df['col2'].nunique() # number of unique elements

3

In [94]:
df['col2'].value_counts() # occurence of an element

444    2
555    1
666    1
Name: col2, dtype: int64

In [98]:
df.nunique()

col1    4
col2    3
col3    4
dtype: int64

In [99]:
def times2(x):
    return x*2

In [100]:
df['col2'].apply(times2) # applying custom method on column

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [102]:
df['col3'].apply(len) # applying built in method on column

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [104]:
df['col2'].apply(lambda x: x*2) # lambda expression with dataframe

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [106]:
df.drop('col2', axis=1)

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [112]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [118]:
df.isnull() # check for null and is same as isna()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

#### Pivot Table

In [119]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [120]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [122]:
df.pivot_table('D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

#### Reading data from html

In [123]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [126]:
df[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","August 22, 2019"
1,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"
2,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","August 12, 2019"
3,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","January 29, 2019"
4,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"

In [147]:
df2 = pd.read_html('https://www.icc-cricket.com/match/15296#scorecard')

In [148]:
len(df2)

12

In [156]:
df2[6]

,Batsmen India Batting,R,B,4s,6s,SR
0,Mayank AgarwalM Agarwal c Faf du Plessis b Ke...,7,31,1,0,22.58
1,Rohit SharmaR Sharma st Quinton de Kock b Kes...,127,149,10,7,85.23
2,Cheteshwar PujaraC Pujara lbw Vernon Philander,81,148,13,2,54.72
3,Ravindra JadejaR Jadeja b Kagiso Rabada,40,32,0,3,125.00
4,Virat KohliV Kohli CPT NOT OUT,31,25,3,1,124.00
5,Ajinkya RahaneA Rahane NOT OUT,27,17,4,1,158.82
6,Hanuma VihariH Vihari,-,-,-,-,-
7,Wriddhiman SahaW Saha,-,-,-,-,-
8,Ravichandran AshwinR Ashwin,-,-,-,-,-
9,Ishant SharmaI Sharma,-,-,-,-,-
10,Mohammed ShamiM Shami,-,-,-,-,-
11,"Extras (b 8, lb 2)",10,NaN,NaN,NaN,NaN
12,"Total (4 wickets, 67 overs)",323,NaN,NaN,NaN,NaN

In [ ]:
value = "2012-09"